## **QUESTION 1**
## **Create 2 data set**
### **1.INDIA_WEATHER**

In [1]:
import pandas as pd

india_weather ={
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
}
df1=pd.DataFrame(india_weather)
#df1.to_csv("india_weather.csv",index=False)
#df1.to_excel("india_weather.xlsx",index=False)
df1

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

### **2.US_WEATHER**

In [2]:
us_weather ={
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
}
df2=pd.DataFrame(us_weather)
df2.to_csv("us_weather.csv",index=False)
df2

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

## **DATA FRAME JOIN & ADD NEW COLUMN INDIA AND US**

In [5]:
frames=[df1,df2]
#result=pd.concat(frames,)
df3=pd.concat(frames, keys=['india','us'])
df3

             city  temperature  humidity
india 0    mumbai           32        80
      1     delhi           45        60
      2  banglore           30        78
us    0  new york           21        68
      1   chicago           14        65
      2   orlando           35        75

In [ ]:
df3.to_csv("weather_final.csv",index=False)
df3.to_excel("weather_final.xlsx",index = False)